tests/artillery/config.yaml
config:
  target: "http://localhost:8000"
  environments:
    qa:
      target: "http://localhost:8000"

  phases:
    - name: "Ramp Test"
    - duration: 60
      arrivalRate: 2
      rampTo: 20
      name: test1
  plugins:
    expect: { }

scenarios:
  - name: "Predict Load Test"
    flow:
      - post:
          url: "/test"
          json:
            a: "somedata"
            b: 3
            c:
              always: "three"
              key_new: 234
              add_dict:
              - last: 1
              - values:
                - 1
                - 2
                - 3
    expect:
      - statusCode: 200
        contentType: json